package com.example.pddmap

object SignObj {
    val signList = listOf(
        SignData(
            Id = 1,
            Name = "Знак 1.25 Дорожные работы",
            Descript = "Дорожный знак \"Дорожные работы\" 1.25 предупреждает водителя о том, что он подъезжает к участку дороги, где проводятся ремонтные работы.",
            Img = R.drawable.s1_25
        ),
        SignData(
            Id = 2,
            Name = "Знак 2.4 Уступите дорогу",
            Descript = "Водитель должен уступить дорогу транспортным средствам, движущимся по пересекаемой дороге, а при наличии таб.8.13  — по главной.",
            Img = R.drawable.s2_4
        ),
        SignData(
            Id = 3,
            Name = "Знак 3.1 Въезд запрещен",
            Descript = "Дорожный знак 3.1. “Въезд запрещен” ограничивает въезд на определенную часть дорожного полотна для всех транспортных средств, за исключением маршрутных автобусов и такси.",
            Img = R.drawable.s3_1
        ),
        SignData(
            Id = 4,
            Name = "Знак 3.27 Остановка запрещена",
            Descript = "Знак 3.27 запрещает остановку, а следовательно и стоянку всех транспортных средств, за исключением маршрутных ТС.",
            Img = R.drawable.s3_27
        ),
        SignData(
            Id = 5,
            Name = "Знак 5.19.1 Пешеходный переход",
            Descript = "Знаки 5.19.1 и 5.19.2 \"Пешеходный переход\" применяют для обозначения мест, выделенных для перехода пешеходов через дорогу.",
            Img = R.drawable.s5_19_1
        ),
        SignData(
            Id = 6,
            Name = "Знак 5.20 Искусственная неровность",
            Descript = "Знак 5.20 \"Искусственная неровность\" применяют для обозначения границ искусственной неровности.",
            Img = R.drawable.s5_20
        ),
        SignData(
            Id = 7,
            Name = "Знак 6.4 Парковка",
            Descript = "Знак 6.4 \"Парковка (парковочное место)\" применяют для обозначения площадок, предназначенных для стоянки транспортных средств",
            Img = R.drawable.s6_4
        ),
        SignData(
            Id = 8,
            Name = "Знак 2.1 Главная дорога",
            Descript = "Знак 2.1 с табличкой 8.13 устанавливают перед перекрестками, на которых главная дорога изменяет направление, а также перед перекрестками со сложной планировкой.",
            Img = R.drawable.s2_1
        ),
        SignData(
            Id = 9,
            Name = "Знак 3.24 Ограничение максимальной скорости (5 км/ч)",
            Descript = "Знак 3.24 устанавливает максимальный скоростной порог движения ТС на дорожном участке, на который распространяется его действие.",
            Img = R.drawable.s3_24_5
        ),
        SignData(
            Id = 10,
            Name = "Знак 3.24 Ограничение максимальной скорости (20 км/ч)",
            Descript = "Знак 3.24 устанавливает максимальный скоростной порог движения ТС на дорожном участке, на который распространяется его действие.",
            Img = R.drawable.s3_24_20
        ),
        SignData(
            Id = 11,
            Name = "Знак 3.24 Ограничение максимальной скорости (40 км/ч)",
            Descript = "Знак 3.24 устанавливает максимальный скоростной порог движения ТС на дорожном участке, на который распространяется его действие.",
            Img = R.drawable.s3_24_40
        ),
        SignData(
            Id = 12,
            Name = "Знак 3.24 Ограничение максимальной скорости (50 км/ч)",
            Descript = "Знак 3.24 устанавливает максимальный скоростной порог движения ТС на дорожном участке, на который распространяется его действие.",
            Img = R.drawable.s3_24_50
        ),
        SignData(
            Id = 13,
            Name = "Знак 3.24 Ограничение максимальной скорости (60 км/ч)",
            Descript = "Знак 3.24 устанавливает максимальный скоростной порог движения ТС на дорожном участке, на который распространяется его действие.",
            Img = R.drawable.s3_24_60
        ),
        SignData(
            Id = 14,
            Name = "Знак 3.24 Ограничение максимальной скорости (70 км/ч)",
            Descript = "Знак 3.24 устанавливает максимальный скоростной порог движения ТС на дорожном участке, на который распространяется его действие.",
            Img = R.drawable.s3_24_70
        ),
        SignData(
            Id = 15,
            Name = "Знак 3.24 Ограничение максимальной скорости (90 км/ч)",
            Descript = "Знак 3.24 устанавливает максимальный скоростной порог движения ТС на дорожном участке, на который распространяется его действие.",
            Img = R.drawable.s3_24_90
        )
    )
}